; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-6)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city1)
	(= (capacity plane1) 13464)
	(= (fuel plane1) 4412)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 11)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 5)
	(at person1 city3)
	(at person2 city2)
	(at person3 city0)
	(at person4 city0)
	(at person5 city2)
	(at person6 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 691)
	(= (distance city0 city2) 765)
	(= (distance city0 city3) 537)
	(= (distance city1 city0) 691)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 838)
	(= (distance city1 city3) 825)
	(= (distance city2 city0) 765)
	(= (distance city2 city1) 838)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 940)
	(= (distance city3 city0) 537)
	(= (distance city3 city1) 825)
	(= (distance city3 city2) 940)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city3)
	(at person2 city3)
	(at person3 city0)
	(at person4 city2)
	(at person5 city2)
	(at person6 city3)
	))

(:metric minimize (+ (* 4 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (fly plane1 city1 city3)
   deleted: (at plane1 city1)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 0 to 4125, (fuel plane1) from 4412 to 287
   goals met: 3 of 6
2. (refuel plane1 city3)
   changed: (fuel plane1) from 287 to 13464
   goals met: 3 of 6
3. (fly plane1 city3 city2)
   deleted: (at plane1 city3)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 4125 to 8825, (fuel plane1) from 13464 to 8764
   goals met: 3 of 6
4. (board person2 plane1 city2)
   deleted: (at person2 city2)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 6
5. (fly plane1 city2 city0)
   deleted: (at plane1 city2)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 8825 to 12650, (fuel plane1) from 8764 to 4939
   goals met: 3 of 6
6. (board person4 plane1 city0)
   deleted: (at person4 city0)
   added: (in person4 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 6
7. (board person6 plane1 city0)
   deleted: (at person6 city0)
   added: (in person6 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 3 of 6
8. (fly plane1 city0 city3)
   deleted: (at plane1 city0)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 12650 to 15335, (fuel plane1) from 4939 to 2254
   goals met: 3 of 6
9. (debark person2 plane1 city3)
   deleted: (in person2 plane1)
   added: (at person2 city3)
   changed: (onboard plane1) from 3 to 2
   goals met: 4 of 6
10. (debark person6 plane1 city3)
   deleted: (in person6 plane1)
   added: (at person6 city3)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 6
11. (refuel plane1 city3)
   changed: (fuel plane1) from 2254 to 13464
   goals met: 5 of 6
12. (zoom plane1 city3 city2)
   deleted: (at plane1 city3)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 15335 to 25675, (fuel plane1) from 13464 to 3124
   goals met: 5 of 6
13. (debark person4 plane1 city2)
   deleted: (in person4 plane1)
   added: (at person4 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 6 of 6
